# Pandas Serisi Oluşturmak

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

* Bu bir Pandas Series'tir. İlk sütunda görülenlerler **index bilgisi** ikinci sütunda yer alanlar ise içindeki **değerlerdir.**

In [4]:
seri = pd.Series([10,88,3,4,5])

In [5]:
type(seri)

pandas.core.series.Series

* Bununla beraber bu elimzideki yeni bir veri tipi bu veri tipinin bazı özelliklerini temel yapısal özelliklerine erişebiliyoruz.
* seri.axes -> Serinin index bilgilerine erişiyoruz, start=0 sıfırdan başlamış, stop=5 Beşe kadar gitmiş ve step=1 birer birer artmış
* seri.dtype -> veri tipi
* seri.size -> toplam eleman sayısı
* seri.ndim -> boyutunu değerlendirebiliyoruz, tek boyutlu array gibi düşünebiliriz.
* seri.values -> array formunda sadece değer bilgisinede erişebiliriz.
* seri.head() -> serinin ilk 5 elemanını getirir
* seri.tail() -> serinin son 5 elemanını getirir
* seri.concat -> seri birleştirme

In [7]:
# axes -> serinin index bilgilerine erişiyoruz.
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [9]:
# dtype -> serinin içirisindeki değerlerle ilgili bilgi almak için
seri.dtype

dtype('int64')

In [10]:
# size -> içerisindeki eleman sayısını veriyor.
seri.size

5

In [11]:
# ndim -> boyutunu değerlendirebiliyoruz, tek boyutlu array gibi düşünebiliriz
seri.ndim

1

In [43]:
# values -< bir array formunda sadece değer bilgisinede erişebiliriz.
seri.values

array([10, 11, 12], dtype=int64)

In [44]:
# head -> serinin ilk 5 elemanına erişebiliriz.
seri.head()

reg     10
loj     11
cart    12
dtype: int64

In [45]:
# tail -> serinin içindeki son 5 elemanı getirir.
seri.tail()

reg     10
loj     11
cart    12
dtype: int64

### İndex isimlendirmesi, index değiştirme

In [21]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [26]:
# index argümanı ile index isimlerini değiştirebiliriz.
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [46]:
# İsimlendirmeleri kategorik değerlerde kullanabiliriz.
pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [28]:
seri = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

In [29]:
seri["a"]

99

In [31]:
# içerisinde slice işlemleride yapabiliyoruz
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [32]:
# sozluk üzerinden pandas series'i oluşturma

In [35]:
sozluk = {"reg":10, "loj":11, "cart":12}
seri = pd.Series(sozluk)
seri

reg     10
loj     11
cart    12
dtype: int64

In [40]:
seri["reg":"loj"]

reg    10
loj    11
dtype: int64

In [41]:
# iki seriyi birleştirerek seri oluşturma

In [42]:
pd.concat([seri, seri])

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

# Eleman İşlemleri

* Ne yaptık, öncelikle bir PANDAS serisini yapısal olarak ele aldık ve index bileşenine ve değerler bileşenine ayrı ayrı erişebileceğimizi öğrendik. (seri.index), (seri.value)
* Bunun dışında klasik anlamdaki büyün index işlemlerini yapabileceğimizi öğrendik
* Eleman sorgulama, fancy ve slice işlemlerinin burada geçerli olduğunu gördük.

In [1]:
import pandas as pd
import numpy as np
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [3]:
seri[0]

1

In [2]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [26]:
# Eğer gerçek hayatta Pandas serisi ile çalışıyorsak genelde elimizde bu şekilde bir veri olur
seri = pd.Series([121,200,150,99], index = ["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [12]:
#seri.index = ["a","b","c","d"]
#seri

In [13]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [14]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [17]:
# her bir key değerine karşılık gelen value değerlerini vermiş, bu şekilde bir görünüm istersek kullanabiliriz
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [18]:
seri.values

array([121, 200, 150,  99], dtype=int64)

### Eleman sorgulama

In [19]:
# reg ifadesinin bu seri içinde yer alıp almadığını sorgulama
"reg" in seri

True

In [20]:
"a" in seri

False

In [21]:
seri["reg"]

121

### Fancy ile eleman seçme

In [22]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [23]:
seri["reg"] = 130
seri

reg     130
loj     200
cart    150
rf       99
dtype: int64

In [24]:
# slice işlemi ile

In [25]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

# PANDAS DataFrame Oluşturma

In [34]:
import pandas as pd
import numpy as np

* DataFrame'ler bizim için Veri Bilimi ve Yapay Zeka kapsamında en sık kullancak olduğumuz veri yapılarıdır, bu sebeple DataFrame'ler üzerinde veri manipulasyonları anlamında diğer veri tiplerinden çok daha fazla durucucaz, bizim için kilit roldeki veri yapısı veri tipi PANDAS DataFrame'ler ve ana rolü oynuyacak olan operatif işlemlerde Pandas işelemleridir.

In [32]:
# bir liste üzerinden oluşturalım
l = [1,2,39,67,90]
print(l)

[1, 2, 39, 67, 90]

In [33]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [35]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [38]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [39]:
# Değişken isimlerini dışarıdan değiştirme

In [41]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [42]:
# df.columns bize dataframe'deki değişken isimlerini getiri
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [43]:
# değişken isimlerini değiştirmek için
df.columns = ["deg1","deg2","deg3"]
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
type(df)

pandas.core.frame.DataFrame

In [53]:
# ndim -> boyut sayısını verir
df.ndim

2

In [52]:
# shape -> boyut bilgisini verdi
df.shape

(3, 3)

In [54]:
# size -> toplam eleman sayısı
df.size

9

In [51]:
# axes -> index bilgilerini verir, 0'dan başlamış 3'e kadar gitmiş, birer birer artmış
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [56]:
# array formatında sadece değerleri getirir
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [59]:
# numpy array nesnesine çeviri
type(df.values)

numpy.ndarray

In [62]:
# head() -> baştan ilk 5 elemanı getiri
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [63]:
# tail() -> sondan 5 elamanı getirir
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [67]:
# NumPy array'i üzerindende kolay bir şekilde DataFrame oluşturabildik
a = np.array([1,2,3,4,5])
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

# Eleman İşlemleri

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [7]:
# numpy arrayleri üzerinden bir sözlük oluşturduk
sozluk = {"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([7, 4, 2, 6, 6]),
 'var2': array([8, 9, 4, 4, 0]),
 'var3': array([1, 3, 9, 6, 5])}

In [79]:
# sozluk üzerinden dataframe oluşturma
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     7     8     1
1     4     9     3
2     2     4     9
3     6     4     6
4     6     0     5

In [15]:
df[0:1]

   var1  var2  var3
0     7     8     1

In [78]:
df["var1"]

b    4
c    2
d    6
e    6
Name: var1, dtype: int32

In [80]:
# index -> index bilgilerini getirir
df.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
# index isimlerini kendimiz atayabiliriz
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     7     8     1
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [27]:
df["c":"e"]

   var1  var2  var3
c     2     4     9
d     6     4     6
e     6     0     5

### Silme İşlemi
* axis = 0 yapıyoruz ki satırı almak istediğimiz bilgisini Pandas'a vermiş olalım, yan, bütün satırı sil diyoruz.

In [29]:
df.drop("a", axis = 0)

   var1  var2  var3
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [31]:
# Gözlemleneceği üzerinde dataframe'in ana yapsı üzerinde bir değişiklik olmadı, eğer ben a'nın silinmiş 
# olduğu dataframe'i yeni dataframe olarak tanımlamak istersem, eski yöntemlerden alışık olduğum şekliyle 
# bu dataframi baştan tanımlaya bilirim yada daha gelişmiş bir yöntem olarak Pandas'ın bize sunmuş olduğu 
# özelliklerinden birisi olarak inplace argümanını kullanabilirim
df

   var1  var2  var3
a     7     8     1
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [32]:
df.drop("a", axis = 0, inplace = True)

In [38]:
# artık "a" kalıcı olarak silindi.
# Dolayısıyla burada inplace = True işlememinin görevi dataframe üzerinde yapılan değişikliğin kalıcı 
# olmasını saplamaktır. Yeniden atama işlemine gerek olmadan yapmış olduğumuz bu değişikiği kalıcı bir 
# şekilde datafram2 kayıt eder. inplace = True argümanı önümüzdeki ilerleyen bölümlerde çok sık kullanacak
# olduğumuz bir argüman. 
# Eksen ayralaması için kullanacak olduğumuz axis argümanıda önemli
# axis = 0 -> satır
# axis = 1 -> sütun
df

   var1  var2  var3
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [43]:
# c ve d'yi silmek istersek ne yapıcaz, yarı ayrımı yazıcaz
# fanyc ile yapabiriz
l = ["c","e"]
df.drop(l, axis = 0)

   var1  var2  var3
b     4     9     3
d     6     4     6

In [44]:
# degiskenler için

In [45]:
"var1" in df

True

In [59]:
# bu değişkenler bu dataframin içinde varmı diye bakıcaz
l = ["var1","var2","var4"]

In [63]:
# for'un içinde gez, l'nin içindeki her eleman df'in içindemi diye sorgula
for i in l:
    print(i in df)

True
True
False

* Yeni bir değişken oluşturmak istediğimizi düşünelim fakat bu değişkeni dataframe içerisinde yer alan değişkenler üzerinden yapmak istediğimizi düşünelim.
* Mesela yeni değişkeni var1 / var2 üzerinden yapalım

In [67]:
df

   var1  var2  var3
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [68]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     4     9     3  0.444444
c     2     4     9  0.500000
d     6     4     6  1.500000
e     6     0     5       inf

In [69]:
# değişken silmek
# axis = 1
df.drop("var4", axis = 1)

   var1  var2  var3
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [71]:
df.drop("var4", axis = 1, inplace = True)

In [73]:
# var4 kalıcı olarak silinci
df

   var1  var2  var3
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

In [74]:
# fancy ile silme

In [76]:
l = ["var1","var2"]
df.drop(l, axis = 1)

   var3
b     3
c     9
d     6
e     5

In [77]:
df

   var1  var2  var3
b     4     9     3
c     2     4     9
d     6     4     6
e     6     0     5

# Gözlem Değişken Seçimi : loc ve iloc

In [1]:
import pandas as pd
import numpy as np
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     9    19    26
1    22    18     5
2    22    23    20
3     2    14    22
4    17     4    27
5     4    29     6
6    18    27     4
7     6    28    23
8    20    27    23
9    12     4     8

In [2]:
?np.random.randint

Docstring:
randint(low, high=None, size=None, dtype=int)

Return random integers from `low` (inclusive) to `high` (exclusive).

Return random integers from the "discrete uniform" distribution of
the specified dtype in the "half-open" interval [`low`, `high`). If
`high` is None (the default), then results are from [0, `low`).

.. note::
    New code should use the ``integers`` method of a ``default_rng()``
    instance instead; please see the :ref:`random-quick-start`.

Parameters
----------
low : int or array-like of ints
    Lowest (signed) integers to be drawn from the distribution (unless
    ``high=None``, in which case this parameter is one above the
    *highest* such integer).
high : int or array-like of ints, optional
    If provided, one above the largest (signed) integer to be drawn
    from the distribution (see above for behavior if ``high=None``).
    If array-like, must contain integer values
size : int or tuple of ints, optional
    Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
    ``m * n * k`` samples are drawn.  Default is None, in which case a
    single value is returned.
dtype : dtype, optional
    Desired dtype of the result. Byteorder must be native.
    The default value is int.

    .. versionadded:: 1.11.0

Returns
-------
out : int or ndarray of ints
    `size`-shaped array of random integers from the appropriate
    distribution, or a single such random int if `size` not provided.

See Also
--------
random_integers : similar to `randint`, only for the closed
    interval [`low`, `high`], and 1 is the lowest value if `high` is
    omitted.
Generator.integers: which should be used for new code.

Examples
--------
>>> np.random.randint(2, size=10)
array([1, 0, 0, 0, 1, 1, 0, 0, 1, 0]) # random
>>> np.random.randint(1, size=10)
array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

Generate a 2 x 4 array of ints between 0 and 4, inclusive:

>>> np.random.randint(5, size=(2, 4))
array([[4, 0, 2, 1], # random
       [3, 2, 2, 0]])

Generate a 1 x 3 array with 3 different upper bounds

>>> np.random.randint(1, [3, 5, 10])
array([2, 2, 9]) # random

Generate a 1 by 3 array with 3 different lower bounds

>>> np.random.randint([1, 5, 7], 10)
array([9, 8, 7]) # random

Generate a 2 by 4 array using broadcasting with dtype of uint8

>>> np.random.randint([1, 3, 5, 7], [[10], [20]], dtype=np.uint8)
array([[ 8,  6,  9,  7], # random
       [ 1, 16,  9, 12]], dtype=uint8)
Type:      builtin_function_or_method

In [9]:
# loc: tanımlandığı şekli ile seçim yapmak için kullanılır
# bu veri setinin ilk halindeki index'lemeye sadık kalacak şekilde nasıl bir indexleme varsa buna göre olacak
# şekilde bize bir seçim imkanı sunar
# Normal şartlarda alışık olduğumuz mantık 3'e kadar ama 3.indexi dahil edilmez ama loc'da yazılan indexide
# getirir -> 0, 1, 2 ve 3. indexleri getirdi

In [4]:
df.loc[0:3]

   var1  var2  var3
0     9    19    26
1    22    18     5
2    22    23    20
3     2    14    22

In [10]:
# iloc: alışık olduğumuz indexleme mantığıyla seçim yapar
# 0, 1 ve 2.indexleri getirdi

In [8]:
df.iloc[0:3]

   var1  var2  var3
0     9    19    26
1    22    18     5
2    22    23    20

In [11]:
df.iloc[0,0]

9

In [18]:
df.iloc[4,2]

27

In [22]:
# 3.satıra kadar al, 2.sütuna kadar al
df.iloc[:3,:2]

   var1  var2
0     9    19
1    22    18
2    22    23

In [28]:
df.loc[0:3,"var3"]

0    26
1     5
2    20
3    22
Name: var3, dtype: int32

In [29]:
df.iloc[0:3,"var3"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [31]:
# eğer yada değişken yada gözlem birimleri yani satırlarla ilgili mutlak bir değer işaretlemesi yapacaksak
# loc kullanmak gerekir
# Yani index isimlerine göre seçme işlemi yapacaksak loc kullanılır

In [32]:
df.iloc[0:3,1:3]

   var2  var3
0    19    26
1    18     5
2    23    20

In [33]:
df.iloc[0:3]

   var1  var2  var3
0     9    19    26
1    22    18     5
2    22    23    20

In [37]:
# iloc ile sadece var3 seçtik
df.iloc[0:3]["var3"]

0    26
1     5
2    20
Name: var3, dtype: int32

* Eğer verilen kurallar bağlı bir şekilde seçim yapılma ihtiyacı varsa gözlem yada değişken isimlendirmeleri  açısından **loc** yapısı kullanılır
* Eğer verilen isimlendirmelerden bağımsız ben bunlara takılmıyorum alışık olduğum klasik index mantığı ile seçim yapmak isyorum dersekte bu seferde **iloc** kullanılır.

# Koşullu Eleman İşlemleri

In [15]:
import pandas as pd
import numpy as np
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     2    28     4
1    13     1    29
2    13     1    10
3    28     8     7
4    29    28    24
5    25    15    14
6    13    18    15
7    29    24     9
8    20    18    17
9    20    15    17

In [16]:
# Değişken seçme
df["var1"]

0     2
1    13
2    13
3    28
4    29
5    25
6    13
7    29
8    20
9    20
Name: var1, dtype: int32

In [17]:
df["var1"][0:2]

0     2
1    13
Name: var1, dtype: int32

In [19]:
df[0:2][["var1","var2"]]

   var1  var2
0     2    28
1    13     1

In [18]:
df[0:2]

   var1  var2  var3
0     2    28     4
1    13     1    29

In [20]:
df.iloc[0:2]["var1"]

0     2
1    13
Name: var1, dtype: int32

In [21]:
df

   var1  var2  var3
0     2    28     4
1    13     1    29
2    13     1    10
3    28     8     7
4    29    28    24
5    25    15    14
6    13    18    15
7    29    24     9
8    20    18    17
9    20    15    17

In [42]:
# 1.değişkendeki değerlerin 5'ten büyük olma durumu
# df[] -> bu dataframe'in içerisine gideceğim bilgisini vermek istiyorum
# df[df.var1 > 15] -> dataframe'in içerisinden var1'i seç ve 15'ten büyük olan getir

In [23]:
df[df.var1 > 15]

   var1  var2  var3
3    28     8     7
4    29    28    24
5    25    15    14
7    29    24     9
8    20    18    17
9    20    15    17

In [24]:
[df.var1 > 15]

[0    False
 1    False
 2    False
 3     True
 4     True
 5     True
 6    False
 7     True
 8     True
 9     True
 Name: var1, dtype: bool]

In [28]:
# var1'de 15'ten büyük olan değerleri seçer ve sadece "var1" i getirir
df[df.var1 > 15]["var1"]

3    28
4    29
5    25
7    29
8    20
9    20
Name: var1, dtype: int32

In [29]:
# birden fazla koşul girmek istersek

In [34]:
df[(df.var1 > 15) & (df.var3 < 10)]

   var1  var2  var3
3    28     8     7
7    29    24     9

In [38]:
# yine var1'in 15'ten büyük olmasını isteyelim ama gelen datafram'in içerisinden iki tane değişken 
# seçmek isteyelim.
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
3    28     8
4    29    28
5    25    15
7    29    24
8    20    18
9    20    15

In [39]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
3    28     8
4    29    28
5    25    15
7    29    24
8    20    18
9    20    15

# Birleştirme (Join) İşlemleri

In [5]:
import pandas as pd
import numpy as np
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    14    29     2
1    19    16    28
2     4    23    10
3    25    29    22
4     1    12     6

In [4]:
# birleştirme için kullanacağımız birinci teknik concat tekniği

In [6]:
# yeni bir dataframe oluşturalım, df1'in üstüne 99 ekleyip yeni bir dataframe oluşturduk
df2 = df1 + 99
df2

   var1  var2  var3
0   113   128   101
1   118   115   127
2   103   122   109
3   124   128   121
4   100   111   105

In [11]:
#birleştirme
# indexler baştan başlıyor
pd.concat([df1, df2])

   var1  var2  var3
0    14    29     2
1    19    16    28
2     4    23    10
3    25    29    22
4     1    12     6
0   113   128   101
1   118   115   127
2   103   122   109
3   124   128   121
4   100   111   105

In [12]:
pd.concat([df1, df2], axis = 1)

   var1  var2  var3  var1  var2  var3
0    14    29     2   113   128   101
1    19    16    28   118   115   127
2     4    23    10   103   122   109
3    25    29    22   124   128   121
4     1    12     6   100   111   105

* programlama dilini özellikle burada Pandas içerisinde yer alan bir fonksiyonu kullandığımız esnada fonksiyonun çıktısında hoşumuza gitmeyen bir şeyler varsa öncelikle bu fonksiyonu biçimlendirilip , biçimlendirilemeyeceğini bir araştırmamız gerekir. Yani bu fonksiyonu yazan kişi elbette böyle bir problemle karşılaşacağımızı öngörüp buna bir çözüm yolu bulumuştur gibi düşünüp fonksiyonun üzerinde incelemeye gitmemiz gerekiyor.

In [14]:
#biz burada bir index problemiyle karşılaştık, hiçbir şey bilmesek bile indexle ilgili birşeyler arayabiliriz
# ignore index
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[ForwardRef('NDFrame')], Mapping[Union[Hashable, NoneType], ForwardRef('NDFrame')]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\ygtoz\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [16]:
# indexler düzeldi, sırayla gidiyor
pd.concat([df1, df2], ignore_index = True)

   var1  var2  var3
0    14    29     2
1    19    16    28
2     4    23    10
3    25    29    22
4     1    12     6
5   113   128   101
6   118   115   127
7   103   122   109
8   124   128   121
9   100   111   105

In [23]:
# dataframe değişken isimlerine erişme
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [26]:
df2.columns = ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   113   128   101
1   118   115   127
2   103   122   109
3   124   128   121
4   100   111   105

In [30]:
# iki setinin değişken isimleri farklı olduğu için bir problemle karşılaştık, bazı durumlarda veri setlerinde
# gerçekten birbirleriyle tamamlanamayacak şekilde değişken olduğunda bunları bu şekilde birleştirdiğimizde
# böyle bir problemle karşılaşmamız çok normal, örneğin bir veri setinde 3 tane değişken var a,b, isimli
# diğer veri setinde ise a,b,e isimli değişkenler var tıpkı burda olduğu gibi dolayısıyla bir veri setindeki
# değişkenin diğer veri setinde karşılığı yok bu birleştirmeler problemli olacaktır. Teknik olarakta bu
# birleştirmeler çok mantıklı olmayacaktır çünkü aynı bilgiyi taşımıyor nasıl birleştirilecek
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    14    29   2.0    NaN
1    19    16  28.0    NaN
2     4    23  10.0    NaN
3    25    29  22.0    NaN
4     1    12   6.0    NaN
0   113   128   NaN  101.0
1   118   115   NaN  127.0
2   103   122   NaN  109.0
3   124   128   NaN  121.0
4   100   111   NaN  105.0

In [32]:
# join = "inner" kesişimlerine göre birleştirdi
pd.concat([df1, df2], join = "inner")

   var1  var2
0    14    29
1    19    16
2     4    23
3    25    29
4     1    12
0   113   128
1   118   115
2   103   122
3   124   128
4   100   111

In [35]:
#pd.concat([df1, df2], join_axes = [df1.columns]) -> kullanımdan kalmış

In [49]:
# birleştirme işlemi yapsın ama df1 değişkenlerine göre yapsın
pd.concat([df1, df2],  ignore_index = True)[df1.columns]

   var1  var2  var3
0    14    29   2.0
1    19    16  28.0
2     4    23  10.0
3    25    29  22.0
4     1    12   6.0
5   113   128   NaN
6   118   115   NaN
7   103   122   NaN
8   124   128   NaN
9   100   111   NaN

# İleri Birleştirme İşlemleri

In [1]:
import pandas as pd

* **ileri birleştirme işlemleri ->** öceki bölümde ele aldığımız birleştirme işlemleri kabaca basit birleştirme işlemleri gibi düşünülebilir alt alta koymak, yan yana koymak vs. şeklinde. Bu bölümde ise biraz daha ileri seviyede ihtiyaçlarımıza yönelik olarak özel senaryolar ile birleştirme işlemlerini ele alıcaz.

In [40]:
# birebir birleştirme -> tüm elemanların iki veri setindede birebir yer alması durumudur. Burada calisanlar
# değişkenine odaklandığımızda iki veri setindede bu değişkenin değerleri bire bir aynıdır
# bire bir birleştirme en sık kullanılan ve basit birleştirme tekniklerinden birisi
# merge() fonksiyonu kullanılır. merge() fonksiyonu birleştirmelerin hangi değişkene göre yapılacağını
# kendisi anlıyor , eğer biz bunu özellikle belirtmek istersek belirtebiliyoruz bir argüman aracılığıyla
# on = "calisanlar" seklinde on argümanı ile

In [2]:
df1 = pd.DataFrame({"calisanlar": ["Ali","Veli","Ayşe","Fatma"], 
                   "grup": ["Muhasebe","Muh","Muh","İK"] })

df1

  calisanlar      grup
0        Ali  Muhasebe
1       Veli       Muh
2       Ayşe       Muh
3      Fatma        İK

In [3]:
df2 = pd.DataFrame({"calisanlar": ["Ali","Veli","Ayşe","Fatma"], 
                   "ilk_giris": [2010, 2009, 2014, 2019] })

df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayşe       2014
3      Fatma       2019

In [4]:
# bire bir birleştirme
pd.merge(df1, df2)

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayşe       Muh       2014
3      Fatma        İK       2019

In [5]:
pd.merge(df1, df2, on = "calisanlar")

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayşe       Muh       2014
3      Fatma        İK       2019

In [26]:
# many to one -> çoktan teke birleştirme
# çoklama yapı ile tekil yapı birleştirme işlemi gerçekleşir

In [8]:
df3 = pd.merge(df1, df2)
df3

  calisanlar      grup  ilk_giris
0        Ali  Muhasebe       2010
1       Veli       Muh       2009
2       Ayşe       Muh       2014
3      Fatma        İK       2019

In [9]:
df4 = pd.DataFrame({"grup": ["Muhasebe","Muh","İK"], 
                   "mudur": ["Caner","Mustafa","Berkcan"]})

df4

       grup    mudur
0  Muhasebe    Caner
1       Muh  Mustafa
2        İK  Berkcan

In [32]:
# df3 -> calisanlar, grup ve giris_yili olmak üzere 3 değişken var -> çoklu yapı
# df4 -> grup ve mudur olmak üzere 2 değişken var -> tekli yapı
# ortak değişken ne "grup" değişkeni gruba göre birleştireme işlemi yapılacak
pd.merge(df3, df4)

  calisanlar      grup  ilk_giris    mudur
0        Ali  Muhasebe       2010    Caner
1       Veli       Muh       2009  Mustafa
2       Ayşe       Muh       2014  Mustafa
3      Fatma        İK       2019  Berkcan

In [33]:
# many to many -> çoktan çoka birleştirme işlemi

In [15]:
df5 = pd.DataFrame({"grup": ["Muhasebe","Muhasebe","Muh","Muh","İK","İK"],
                   "yetenekler": ["matematik","exvel","kodlama","linux",
                                  "excel","yonetim"] })

df5

       grup yetenekler
0  Muhasebe  matematik
1  Muhasebe      exvel
2       Muh    kodlama
3       Muh      linux
4        İK      excel
5        İK    yonetim

In [36]:
df1

  calisanlar      grup
0        Ali  Muhasebe
1       Veli       Muh
2       Ayşe       Muh
3      Fatma        İK

In [39]:
# çalışanlar normalde tekilde birleştireme ile çokladı ve her birisine karşılık gelen grupla beraber 
# yetenekleride yanlarına eklendi, her çalışanın birden fazla yetenği var

pd.merge(df1, df5)

  calisanlar      grup yetenekler
0        Ali  Muhasebe  matematik
1        Ali  Muhasebe      exvel
2       Veli       Muh    kodlama
3       Veli       Muh      linux
4       Ayşe       Muh    kodlama
5       Ayşe       Muh      linux
6      Fatma        İK      excel
7      Fatma        İK    yonetim

In [16]:
pd.merge(df3,df5)

  calisanlar      grup  ilk_giris yetenekler
0        Ali  Muhasebe       2010  matematik
1        Ali  Muhasebe       2010      exvel
2       Veli       Muh       2009    kodlama
3       Veli       Muh       2009      linux
4       Ayşe       Muh       2014    kodlama
5       Ayşe       Muh       2014      linux
6      Fatma        İK       2019      excel
7      Fatma        İK       2019    yonetim

# Toplulaştırma ve Gruplama (Aggregation & Grouping)

Basit toplulaştırma fonksiyonları

* count() 
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
*sum()

In [1]:
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset("planets")
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [3]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\ygtoz\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [5]:
# Hemen işlemlere başlamadan veri setini bir gözlemleyelim.

In [8]:
# 1035 gözlemden ve 6 değişkenden oluşuyor.
df.shape

(1035, 6)

In [11]:
# mean() -> bütün değişkenlerin ortalam değerlerini verdi.
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [15]:
# Eğer sadece bir değişken üzerinde gözlemlemek istersek önce değişkeni seçip, daha sonra toplaştırma
# fonksyisiyonumuzu yazarız.
df["mass"].mean()

2.6381605847953233

In [18]:
# count() -> içerisindeki değerleri saymak için kullanılır.
df["mass"].count()

513

In [19]:
# min() -> içerideki min değeri verir.
df["mass"].min()

0.0036

In [21]:
# max() -> içerisindeki max değeri verir.
df["mass"].max()

25.0

In [23]:
# sum() -> içirisindeki değerleri toplar.
df["mass"].sum()

1353.37638

In [27]:
# std() -> standart sapmayı verir.
df["mass"].std()

3.8186166509616046

In [28]:
# var() -> varyansı verir.
df["mass"].var()

14.58183312700122

In [31]:
# describe() -> tüm değişkenlerin betimsel istatistiklerini ortaya koyabiliyoruz.
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [34]:
# traspozunu aldık daha okunur bir from haline getirdik
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

* **!Not!**
*    PANDAS'ı Veri Manipulasyonu işlemleri için yapısal bir araç olarak ele alıyoruz.

In [40]:
# Elimizdeki veri seti içirisinde eksik değerler olursa ki, bu çok sık karşılaştığımız bir durum fakat yinede
# ben betimsel istatisklerine bakmak istiyorum diye düşünürsek bunun için df.dropna().describe().T 
# kullanabiliriz.
# İçindeki eksik gözlemleri sildi

In [38]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemi

In [13]:
import pandas as pd
import seaborn as sns

In [38]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"], 
                  "veri": [10,11,52,23,43,55]}, columns = ["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [39]:
# dataframe'e git groupby değişkeni ile gruplar değişkenini yakala bu gruplar değişkenin içerisinde yer 
# alan kategori sınıflarını tut, AMA groupby fonksiyonunun ben tek başıma çalışamam bana aggregation 
# fonksiyonu lazım yani toplulaştırma fonksiyonu lazım.
df.groupby("gruplar")

In [10]:
# yakalanan A,B,C sınıflarının ortalamasını aldı
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [12]:
# sınıfları topladı
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [40]:
# birde önceki bölümde yer alan veri seti üzerinde gruplama işlemleri yapalım
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [18]:
df.groupby("method")

In [20]:
df.groupby("method").mean()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,1.000000,631.180000,NaN,17.875000,2011.500000
Eclipse Timing Variations,1.666667,4751.644444,5.125000,315.360000,2010.000000
Imaging,1.315789,118247.737500,NaN,67.715937,2009.131579
Microlensing,1.173913,3153.571429,NaN,4144.000000,2009.782609
Orbital Brightness Modulation,1.666667,0.709307,NaN,1180.000000,2011.666667
Pulsar Timing,2.200000,7343.021201,NaN,1200.000000,1998.400000
Pulsation Timing Variations,1.000000,1170.000000,NaN,NaN,2007.000000
Radial Velocity,1.721519,823.354680,2.630699,51.600208,2007.518987
Transit,1.954660,21.102073,1.470000,599.298080,2011.236776
Transit Timing Variations,2.250000,79.783500,NaN,1104.333333,2012.500000

In [25]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [28]:
df.groupby("method")["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [32]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [42]:
df.groupby("method")["distance"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

In [36]:
df.groupby("method")["orbital_period"].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

In [47]:
df.groupby("method").count()

                               number  orbital_period  mass  distance  year
method
Astrometry                          2               2     0         2     2
Eclipse Timing Variations           9               9     2         4     9
Imaging                            38              12     0        32    38
Microlensing                       23               7     0        10    23
Orbital Brightness Modulation       3               3     0         2     3
Pulsar Timing                       5               5     0         1     5
Pulsation Timing Variations         1               1     0         0     1
Radial Velocity                   553             553   510       530   553
Transit                           397             397     1       224   397
Transit Timing Variations           4               3     0         3     4

# İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

In [8]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'], 
                  'degisken1': [10,23,33,22,11,99], 
                  'degisken2': [100,253,333,262,111,969]}, 
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [3]:
# aggregate ->

In [5]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [16]:
# sadece ortalamayı değilde min,medyan veya max değerleride hesaplamak isteyelim.
# kendimiz özellikle fonksiyonlar seçmek istiyoruz.
# alt kısımda diyoruzki groupby("gruplar") veri setini gruplara göre böl, 
# pandas'ın içiden olan fonksiyonları tırnak içinde veya sadece max şeklinde yazabiliriz, ama median numpy'ın
# içinde olduğu için onu numpy'dan çağırdık, pandas'ın içinde olmayan fonksiyonları bulundukları kütüphaneden
# import edebiliriz.

In [9]:
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [15]:
df.groupby("gruplar").aggregate([min, np.median, "max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [18]:
# iki değişken için 2 farkılı istatistik hesaplama
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [19]:
df.groupby("gruplar").aggregate({"degisken1": ["min", np.median], 
                                "degisken2": ["std","var"]})

        degisken1          degisken2
              min median         std     var
gruplar
A              10     16  114.551299   13122
B              11     17  100.409163   10082
C              33     66  449.719913  202248

# Filter

* Elimizde bir datafame var bu dataframe'in değişkenlerinin herhangi birisinin üzerinde bir koşul çalıştırmak istiyorum fakat bu koşul öyle karşık bir koşulki mevcut PANDAS fonksiyonlarının içirisinde yer almıyor. 
* Yani bize öyle bir ihtiyaç doğuyorki hem fonksiyonumu kendim tanımlamam ve bunu bir koşulcasına dataframe'in içerisinde yer alan değişkenlerin üzerinede göndermek gerekiyor. 
* Kendi kişisel fonksiyonlarımızı bir bir filtreleme aracı olarak değişkenlerin üzerinde sorgulamak işlemini filter ile ele alıcaz

In [9]:
import pandas as pd

In [10]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'], 
                  'degisken1': [10,23,33,22,11,99], 
                  'degisken2': [100,253,333,262,111,969]}, 
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [29]:
# degisken1'e göre standar sapmalar hesaplandı standar sapması 9'dan büyük olan değerler getirldi grup 
# bazında.

In [26]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [30]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [27]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [40]:
df.groupby("gruplar").median()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [37]:
def filter_func2(x):
    return x["degisken1"].median() > 20

In [38]:
df.groupby("gruplar").filter(filter_func2)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

# Transform

In [13]:
import pandas as pd

In [15]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'], 
                  'degisken1': [10,23,33,22,11,99], 
                  'degisken2': [100,253,333,262,111,969]}, 
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [18]:
df["degisken1"] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [21]:
df.mean()

degisken1     33.0
degisken2    338.0
dtype: float64

In [22]:
# her bir değişkenden ortalamayı çıkartır
df.transform(lambda x: x - x.mean())

   degisken1  degisken2 gruplar
0      -23.0     -238.0     NaN
1      -10.0      -85.0     NaN
2        0.0       -5.0     NaN
3      -11.0      -76.0     NaN
4      -22.0     -227.0     NaN
5       66.0      631.0     NaN

In [33]:
# DataFrame'in içerisinde gruplar kategroik değişkeni olduğu içn sorun çıkarabilir bizde bunu çıkardık ve 
# sadece degisken1 ve degisken2'yi seçip üzerlerinde uyguladık
# sadece degisken1 ve degisken2'yi seçtik
# PANDAS'ta dataframe'de slice işlemi yapacaksak loc yada iloc kullanmamız gerekir
df_a = df.iloc[:,1:3]

In [28]:
df_a.transform(lambda x: x - x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [37]:
# her bir gözlemden bu değişekin ortalamasını çıkartır, daha sonra her bir gözlemi değişkenin standar 
# sapmasını hesaplar ve böler.

In [35]:
df_a.transform(lambda x: (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [44]:
# gruplar üzerinde yaptık
df.groupby("gruplar").transform(lambda x: x-x.mean())

   degisken1  degisken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0

In [46]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

# apply

In [49]:
import pandas as pd
import numpy as np

In [39]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"], 
                  "degisken1": [10,23,33,22,11,99], 
                  "degisken2": [100,253,333,262,111,969]},
                 columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [47]:
df = pd.DataFrame({ 
                  "degisken1": [10,23,33,22,11,99], 
                  "degisken2": [100,253,333,262,111,969]},
                 columns = ["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [48]:
# apply -> apply fonksiyonu tıpkı transform ve filter fonk. gibi dataframe'in değişkenlerin üzerinde 
# gezinme yeteneği olan ve aggregation yani toplulaştırma amacıyla kullanılabilecek olan bir fonksindur.

In [53]:
# deg1 ve deg2'nin toplamlarını aldı
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [57]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [55]:
## apply, transform ve filter fonk. lambda mimarisi ile inanılmaz iş gören fonksiyonlardır

In [58]:
# peki gruplar olsaydı nasıl bir sonu olucaktı

In [59]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"], 
                  "degisken1": [10,23,33,22,11,99], 
                  "degisken2": [100,253,333,262,111,969]},
                 columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [60]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [63]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [62]:
df.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

# Pivot Tablolar

* Bu bölümde Pivot Tablolaru ele alıcaz.
* Veri Setleri üzerinde bazı satır ve sütun işlemleri yaparak veri setini amaca uygun hale getirmek için kullanılan yapılardır.
* Groupby'ın çok boyutlu versiyonu olarak düşünebiliriz.
* Groupby fonk. kullanılarakta bir pivot işlemi gerçekleştirilebir.
* Pivot -> Örneğin, öncellikle cinsiyete göre veriyi gruplayıp sağ kalma durumlarını ifade eden survived

In [1]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [2]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
# cinsiyete göre veriyi gruplayıp sağ kalma durumlarına göre survived değişkenini inceleyelim.
# hangi değişkene göre gruplama yapıcaz cinsiyet(sex) değişkenine göre tamam peki sürekli 
# değişken olarak hangi değişkeni seçicez survived(hayatta kalama durumu), daha sonra ortalamayı
# ala
# kadınların hayatta kalma durumu daha yüksek görürnüyor bunların yorumlarını keşifçi veri analizi
# dersinde yapıcaz
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [15]:
titanic["survived"].count()

891

In [26]:
# kaç kişi kurtulmuş
sag = 0
no = 0
for i in titanic["survived"]:
    if i == 1:
        sag = sag + 1
    else:
        no = no + 1

print("sag: ",sag)
print("no: ", no)

sag:  342
no:  549

In [4]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [13]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [11]:
# elimizde 2 kategorik değişken ve 1  sürekli değişken var bunları bir pivot table aracılığıyla kesişimlerini
# tablolamış olduk.
# unstack -> unstack'i kaldırdığımızda okunması biraz daha zor oluyor, unstack'de hiyerarşik index yapısı
# çözünmüş olur ve daha kolay okumamız sağlanır
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# Pivot ile Pivot Table

In [21]:
# pivot_table bize diyorki odaklandığın değişken nedir -> survived
# index'in nedir -> cinsiyet diyoruz
# başka hangi değişkene odaklanmak istiyorsun -> class diyoruz
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [18]:
?titanic.pivot_table

Signature:
titanic.pivot_table(
    values=None,
    index=None,
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False,
) -> 'DataFrame'
Docstring:
Create a spreadsheet-style pivot table as a DataFrame.

The levels in the pivot table will be stored in MultiIndex objects
(hierarchical indexes) on the index and columns of the result DataFrame.

Parameters
----------
values : column to aggregate, optional
index : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table index.  If an array is passed,
    it is being used as the same manner as column values.
columns : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table column.  If an array is passed,
    it is being used as the same manner as column values.
aggfunc : function, list of functions, dict, default numpy.mean
    If list of functions passed, the resulting pivot table will have
    hierarchical columns whose top level are the function names
    (inferred from the function objects themselves)
    If dict is passed, the key is column to aggregate and value
    is function or list of functions.
fill_value : scalar, default None
    Value to replace missing values with (in the resulting pivot table,
    after aggregation).
margins : bool, default False
    Add all row / columns (e.g. for subtotal / grand totals).
dropna : bool, default True
    Do not include columns whose entries are all NaN.
margins_name : str, default 'All'
    Name of the row / column that will contain the totals
    when margins is True.
observed : bool, default False
    This only applies if any of the groupers are Categoricals.
    If True: only show observed values for categorical groupers.
    If False: show all values for categorical groupers.

    .. versionchanged:: 0.25.0

Returns
-------
DataFrame
    An Excel style pivot table.

See Also
--------
DataFrame.pivot : Pivot without aggregation that can handle
    non-numeric data.
DataFrame.melt: Unpivot a DataFrame from wide to long format,
    optionally leaving identifiers set.
wide_to_long : Wide panel to long format. Less flexible but more
    user-friendly than melt.

Examples
--------
>>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
>>> df
     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

This first example aggregates values by taking the sum.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum)
>>> table
C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

We can also fill missing values using the `fill_value` parameter.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum, fill_value=0)
>>> table
C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

The next example aggregates by taking the mean across multiple columns.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': np.mean})
>>> table
                D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

We can also calculate multiple types of aggregations for any given
value column.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': [min, max, np.mean]})
>>> table
                D    E
            mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0
File:      c:\users\ygtoz\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [32]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [25]:
# çok boyutlu bir pivot oluşturmak istiyorum
# veri setinin içinde yer alan age değişkenini , ben bu sürekli değişkeni bir kategorik değişkene çevirip 3 
# sınıflı bir kategrorik değişkene çevirip bu kateg. değişkenin sınıflarını pivot tabloyada boyut olarakda 
# ekleyelim

In [28]:
# titanic içindeki age değişkenini böl, nasıl bölücem bana aralıklar ver
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [30]:
# ortaya çıkan sınıfları pivot table'a ekleme
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dış Kaynaktan Veri Okuma

In [1]:
import pandas as pd

In [49]:
# txt formunu ve csv formunu aynı fonksiyon ile okuyabiliyoruz.

In [8]:
pd.read_csv("reading_data/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [14]:
# ilk çalıştırdığımızda gördümüz üzere düzgün bir şekilde okuma gerçeklemedi
# Veri okuma işlemlerinde en sık karşılaşılan problem budur , paylaşılan veri seti genelde csv ve txt
# formunda olduğunda değişkenler birbirinden bazı ayraçlar ile ayrılır. Örneğin biz şuanda ornekcsv.cvs
# dosyasını olduğu gibi çalıştırdık ve okumasını bekledik fakat ayraç olarak ön tanımlı kullanılan değer ,
# olduğundan dolayı bize gelmiş olan bu veri setinde ise ayraç olarak ; kullanıldığından dolayı okuma işlemi 
# hatalı oldu. Bunun için sep = "" argümanını kullanabiliriz. Görüleceği üzere veri düzgün bir 
# şekilde okundu.

In [32]:
# csv_okuma
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [23]:
# txt_okuma -> boşlukları okuyabilir
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [22]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: Union[ForwardRef('PathLike[str]'), str, IO[~T], io.RawIOBase, io.BufferedIOBase, io.TextIOBase, _io.TextIOWrapper, mmap.mmap],
    sep=<object object at 0x0000014C86324220>,
    delimiter=None,
    header='infer',
    names=None,
    index_col=None,
    usecols=None,
    squeeze=False,
    prefix=None,
    mangle_dupe_cols=True,
    dtype=None,
    engine=None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace=False,
    skiprows=None,
    skipfooter=0,
    nrows=None,
    na_values=None,
    keep_default_na=True,
    na_filter=True,
    verbose=False,
    skip_blank_lines=True,
    parse_dates=False,
    infer_datetime_format=False,
    keep_date_col=False,
    date_parser=None,
    dayfirst=False,
    cache_dates=True,
    iterator=False,
    chunksize=None,
    compression='infer',
    thousands=None,
    decimal: str = '.',
    lineterminator=None,
    quotechar='"',
    quoting=0,
    doublequote=True,
    escapechar=None,
    comment=None,
    encoding=None,
    dialect=None,
    error_bad_lines=True,
    warn_bad_lines=True,
    delim_whitespace=False,
    low_memory=True,
    memory_map=False,
    float_precision=None,
    storage_options: Union[Dict[str, Any], NoneType] = None,
)
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
squeeze : bool, default False
    If the parsed data only contains one column then return a Series.
prefix : str, optional
    Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
mangle_dupe_cols : bool, default True
    Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
    'X'...'X'. Passing in False will cause data to be overwritten if there
    are duplicate names in the columns.
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.
engine : {'c', 'python'}, optional
    Parser engine to use. The C engine is faster while the python engine is
    currently more feature-complete.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True.
false_values : list, optional
    Values to consider as False.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``. To parse an index or column with a mixture of timezones,
    specify ``date_parser`` to be a partially-applied
    :func:`pandas.to_datetime` with ``utc=True``. See
    :ref:`io.csv.mixed_timezones` for more.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.
keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

    .. versionadded:: 0.25.0
iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and
    `filepath_or_buffer` is path-like, then detect compression from the
    following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
    decompression). If using 'zip', the ZIP file must contain only one data
    file to be read in. Set to None for no decompression.
thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    .. versionchanged:: 1.2

       When ``encoding`` is ``None``, ``errors="replace"`` is passed to
       ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
       This behavior was previously only the case for ``engine="python"``.
dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
error_bad_lines : bool, default True
    Lines with too many fields (e.g. a csv line with too many commas) will by
    default cause an exception to be raised, and no DataFrame will be returned.
    If False, then these "bad lines" will dropped from the DataFrame that is
    returned.
warn_bad_lines : bool, default True
    If error_bad_lines is False, and warn_bad_lines is True, a warning for each
    "bad line" will be output.
delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this
    option can improve performance because there is no longer any I/O overhead.
float_precision : str, optional
    Specifies which converter the C engine should use for floating-point
    values. The options are ``None`` or 'high' for the ordinary converter,
    'legacy' for the original lower precision pandas converter, and
    'round_trip' for the round-trip converter.

    .. versionchanged:: 1.2

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc., if using a URL that will
    be parsed by ``fsspec``, e.g., starting "s3://", "gcs://". An error
    will be raised if providing this argument with a non-fsspec URL.
    See the fsspec and backend storage implementation docs for the set of
    allowed keys and values.

    .. versionadded:: 1.2

Returns
-------
DataFrame or TextParser
    A comma-separated values (csv) file is returned as two-dimensional
    data structure with labeled axes.

See Also
--------
DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_fwf : Read a table of fixed-width formatted lines into DataFrame.

Examples
--------
>>> pd.read_csv('data.csv')  # doctest: +SKIP
File:      c:\users\ygtoz\anaconda3\lib\site-packages\pandas\io\parsers.py
Type:      function

In [34]:
# exel_dosyası_okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [50]:
df = pd.read_excel("reading_data/ornekx.xlsx")
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [37]:
# Veri tipine baktığım zaman görüldüğü gibi bir DataFrame yani Pandas DataFrame'leri üzerinde görmüş 
# olduğumuz bütün fonksiyonları burada uygulayabiliyoruz.
type(df)

pandas.core.frame.DataFrame

In [39]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [41]:
df.columns = ["A","B","C"]
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [47]:
# dışardan_kendiğimiz_oluşturdumuz_txt_veri_setini_okuma
tips = pd.read_csv("reading_data/data.txt")

In [48]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4